n5/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Companies</name>
  <attributes>
    <name>Alien</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BalanceControl</name>
    <type>
      <types>EnumRef.BalanceControl</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>CodeFiscal</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CostOnline</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CostPrices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDateInTable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Discounts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EarlyPayments</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FullDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Organization</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>PayrollPeriod</name>
    <type>
      <types>EnumRef.TimesheetPeriods</types>
    </type>
  </attributes>
  <attributes>
    <name>Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PricesInTable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductionOrdersInTable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PurchaseOrdersInTable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SalesOrdersInTable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ShippingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VATCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VendorDiscounts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehousesInTable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Cashbook</name>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Page</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/InformationRegisters/Logos/Logos.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Logos</name>
  <resources>
    <name>Logo</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/InformationRegisters/Stamps/Stamps.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Stamps</name>
  <resources>
    <name>Stamp</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/Catalogs/Organizations/Organizations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Organizations</name>
  <basedOn>Catalog.Leads</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Address</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>Alien</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApproveSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Birthday</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Birthplace</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>Chain</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>CodeFiscal</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Contact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerContract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerType</name>
    <type>
      <types>EnumRef.CustomerTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Fax</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>FullDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>Government</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GroupsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Issued</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IssuedBy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ItemsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Lead</name>
    <type>
      <types>CatalogRef.Leads</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ObjectUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentContact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>Phone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Policy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Salesman</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShippingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>ShippingContact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>SIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>CatalogRef.TaxCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxGroup</name>
    <type>
      <types>CatalogRef.TaxGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidTo</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorContract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Web</name>
    <type>
      <types>DefinedType.Web</types>
    </type>
  </attributes>
  <attributes>
    <name>Wholesaler</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ApprovalList</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>Priority</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Properties</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.Properties</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.Properties</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/Catalogs/Companies/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	loadLogo ();
	loadStamp ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure loadLogo ()
	
	data = InformationRegisters.Logos.Get ( new Structure ( "Company", Object.Ref ) ).Logo.Get ();
	if ( data = undefined ) then
		Logo = undefined;
	else
		Logo = PutToTempStorage ( data );
	endif; 
	NewLogo = false;
	
EndProcedure 

&AtServer
Procedure loadStamp ()
	
	data = InformationRegisters.Stamps.Get ( new Structure ( "Company", Object.Ref ) ).Stamp.Get ();
	if ( data = undefined ) then
		Stamp = undefined;
	else
		Stamp = PutToTempStorage ( data );
	endif; 
	NewStamp = false;
	
EndProcedure 

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	init ();
	if ( Object.Ref.IsEmpty () ) then
		fillNew ();
	endif; 
	InvoiceForm.SetLocalCurrency ( ThisObject );
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure init ()
	
	Mobile = Environment.MobileClient ();
	
EndProcedure 

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Write show empty ( Object.Ref );
	|PaymentAddress BankAccount ShippingAddress Organization CreateOrganization enable filled ( Object.Ref );
	|CreateOrganization show empty ( Object.Organization );
	|Logo show filled ( Logo );
	|Upload show empty ( Logo );
	|Stamp show filled ( Stamp );
	|UploadStamp show empty ( Stamp );
	|Splitter show empty ( Logo ) and empty ( Stamp );
	|GroupImages hide Mobile;
	|VATCode show Object.VAT;
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( Parameters.FillingText <> "" ) then
		setOfficialName ( ThisObject );
	endif; 
	
EndProcedure 

&AtServer
Procedure OnWriteAtServer ( Cancel, CurrentObject, WriteParameters )
	
	updateUs ();
	if ( NewLogo ) then
		saveLogo ( CurrentObject );
	endif;
	if ( NewStamp ) then
		saveStamp ( CurrentObject );
	endif;
	
EndProcedure

&AtServer
Procedure updateUs ()
	
	us = Object.Organization;
	if ( us.IsEmpty () ) then
		return;
	endif; 
	fields = DF.Values ( us, "Description, FullDescription" );
	name = Object.Description;
	fullName = Object.FullDescription;
	if ( fields.Description = name
		and fields.FullDescription = fullName ) then
		return;
	endif; 
	obj = us.GetObject ();
	obj.Description = name;
	obj.FullDescription = fullName;
	obj.Write ();
	NameChanged = true;
	
EndProcedure 

&AtServer
Procedure saveLogo ( CurrentObject )
	
	r = InformationRegisters.Logos.CreateRecordManager ();
	r.Company = CurrentObject.Ref;
	if ( Logo = "" ) then
		r.Delete ();
	else
		r.Logo = new ValueStorage ( GetFromTempStorage ( Logo ) );
		r.Write ();
	endif; 
	NewLogo = false;
	
EndProcedure 

&AtServer
Procedure saveStamp ( CurrentObject )
	
	r = InformationRegisters.Stamps.CreateRecordManager ();
	r.Company = CurrentObject.Ref;
	if ( Stamp = "" ) then
		r.Delete ();
	else
		r.Stamp = new ValueStorage ( GetFromTempStorage ( Stamp ) );
		r.Write ();
	endif; 
	NewStamp = false;
	
EndProcedure 

&AtServer
Procedure AfterWriteAtServer ( CurrentObject, WriteParameters )
	
	Appearance.Apply ( ThisObject );

EndProcedure

&AtClient
Procedure AfterWrite ( WriteParameters )
	
	if ( NameChanged ) then
		refreshOrganization ();
	endif; 
	
EndProcedure

&AtClient
Procedure refreshOrganization ()
	
	NotifyChanged ( Object.Organization );
	NameChanged = false;
		
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure CreateOrganization ( Command )
	
	if ( Modified ) then
		if ( not Write () ) then
			return;
		endif;
	endif; 
	newOrganization ();
	
EndProcedure

&AtClient
Procedure newOrganization ()
	
	p = new Structure ( "Company, ChoiceMode", Object.Ref, true );
	OpenForm ( "Catalog.Organizations.ObjectForm", p, Items.Organization );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure DescriptionOnChange ( Item )
	
	setOfficialName ( ThisObject );
	
EndProcedure

&AtClient
Procedure PaymentAddressOnChange ( Item )
	
	setShippingAddress ();
	
EndProcedure

&AtClient
Procedure setShippingAddress ()
	
	address = Object.PaymentAddress;
	if ( address.IsEmpty () ) then
		return;
	endif; 
	if ( Object.ShippingAddress.IsEmpty () ) then
		Object.ShippingAddress = address;
	endif; 

EndProcedure 

&AtClient
Procedure OrganizationOnChange ( Item )
	
	Appearance.Apply ( ThisObject, "Object.Organization" );
	
EndProcedure

&AtClientAtServerNoContext
Procedure setOfficialName ( Form )
	
	object = Form.Object;
	object.FullDescription = object.Description;
	
EndProcedure 

&AtClient
Procedure VATOnChange ( Item )
	
	applyVAT ();
	
EndProcedure

&AtClient
Procedure applyVAT ()
	
	if ( not Object.VAT ) then
		Object.VATCode = "";
	endif;
	Appearance.Apply ( ThisObject, "Object.VAT" );
	
EndProcedure

// *****************************************
// *********** Logo

&AtClient
Procedure LogoClick ( Item, StandardProcessing )
	
	StandardProcessing = false;
	uploadLogo ();
	
EndProcedure

&AtClient
Procedure uploadLogo ()
	
	callback = new NotifyDescription ( "StartUploading", ThisObject );
	LocalFiles.Prepare ( callback );
	
EndProcedure 

&AtClient
Procedure StartUploading ( Result, Params ) export
	
	BeginPutFile ( new NotifyDescription ( "CompleteUpload", ThisObject ), , , true, UUID );
	
EndProcedure 

&AtClient
Procedure CompleteUpload ( Result, Address, FileName, Params ) export
	
	if ( not Result ) then
		return;
	endif; 
	if ( not FileSystem.Picture ( FileName ) ) then
		return;
	endif; 
	Logo = Address;
	Modified = true;
	NewLogo = true;
	Appearance.Apply ( ThisObject, "Logo" );

EndProcedure 

&AtClient
Procedure Upload ( Command )
	
	uploadLogo ();
	
EndProcedure

&AtClient
Procedure ClearLogo ( Command )
	
	removeLogo ();
	Appearance.Apply ( ThisObject, "Logo" );
	
EndProcedure

&AtClient
Procedure removeLogo ()
	
	Logo = "";
	Modified = true;
	NewLogo = true;
	
EndProcedure

// *****************************************
// *********** Stamp

&AtClient
Procedure StampClick ( Item, StandardProcessing )
	
	StandardProcessing = false;
	applyUploadStamp ();
	
EndProcedure

&AtClient
Procedure applyUploadStamp ()
	
	callback = new NotifyDescription ( "StartUploadingStamp", ThisObject );
	LocalFiles.Prepare ( callback );
	
EndProcedure 

&AtClient
Procedure StartUploadingStamp ( Result, Params ) export
	
	BeginPutFile ( new NotifyDescription ( "CompleteUploadStamp", ThisObject ), , , true, UUID );
	
EndProcedure 

&AtClient
Procedure CompleteUploadStamp ( Result, Address, FileName, Params ) export
	
	if ( not Result ) then
		return;
	endif; 
	if ( not FileSystem.Picture ( FileName ) ) then
		return;
	endif; 
	Stamp = Address;
	Modified = true;
	NewStamp = true;
	Appearance.Apply ( ThisObject, "Stamp" );

EndProcedure 

&AtClient
Procedure UploadStamp ( Command )
	
	applyUploadStamp ();
	
EndProcedure

&AtClient
Procedure ClearStamp ( Command )
	
	removeStamp ();
	Appearance.Apply ( ThisObject, "Stamp" );
	
EndProcedure

&AtClient
Procedure removeStamp ()
	
	Stamp = "";
	Modified = true;
	NewStamp = true;
	
EndProcedure



&AtClient
Procedure BeforeWrite(Cancel, WriteParameters)
	
	if ( Object.Description = "ABC Distributions"
		and String ( Object.BankAccount ) = "local B10E" ) then
		raise "Company Bank Account has been changed";
	endif;
	
EndProcedure
